class Cube:
    def __init__(self):
        self.cube = [[['B', 'B', 'B'], ['B', 'B', 'B'], ['B', 'B', 'B']],  # 윗면 파란색  0
                     [['R', 'R', 'R'], ['R', 'R', 'R'], ['R', 'R', 'R']],  # 아랫면 빨간색 1
                     [['O', 'O', 'O'], ['O', 'O', 'O'], ['O', 'O', 'O']],  # 앞면 오렌지색  2
                     [['Y', 'Y', 'Y'], ['Y', 'Y', 'Y'], ['Y', 'Y', 'Y']],  # 뒷면 노란색 3
                     [['W', 'W', 'W'], ['W', 'W', 'W'], ['W', 'W', 'W']],  # 왼쪽면 흰색 4
                     [['G', 'G', 'G'], ['G', 'G', 'G'], ['G', 'G', 'G']]]  # 오른쪽면 초록색 5
        self.Command_Count=0 # 명령어 횟수를 기록